STMicroelectronics/STM32CubeMP13/Projects/STM32MP13XX_CUSTOM_HW/Applications/FileX/Fx_uSD_File_Edit/BSP/stm32mp13xx_valid_sd.c
/** @defgroup STM32MP13XX_VALID_SD_Private_Functions Private Functions
  * @{
  */
#if (USE_HAL_SD_REGISTER_CALLBACKS == 1)
/**
  * @brief SD Abort callbacks
  * @param hsd  SD handle
  * @retval None
  */
static void SD_AbortCallback(SD_HandleTypeDef *hsd)
{
  BSP_SD_AbortCallback((hsd == &hsd_sdmmc[0]) ? 0UL : 1UL);
}

/**
  * @brief Tx Transfer completed callbacks
  * @param hsd  SD handle
  * @retval None
  */
static void SD_TxCpltCallback(SD_HandleTypeDef *hsd)
{
  BSP_SD_WriteCpltCallback((hsd == &hsd_sdmmc[0]) ? 0UL : 1UL);
}

/**
  * @brief Rx Transfer completed callbacks
  * @param hsd  SD handle
  * @retval None
  */
static void SD_RxCpltCallback(SD_HandleTypeDef *hsd)
{
  BSP_SD_ReadCpltCallback((hsd == &hsd_sdmmc[0]) ? 0UL : 1UL);
}
#else
/**
  * @brief SD Abort callbacks
  * @param hsd  SD handle
  * @retval None
  */
void HAL_SD_AbortCallback(SD_HandleTypeDef *hsd)
{
  BSP_SD_AbortCallback((hsd == &hsd_sdmmc[0]) ? 0UL : 1UL);
}

/**
  * @brief Tx Transfer completed callbacks
  * @param hsd  SD handle
  * @retval None
  */
__weak void HAL_SD_TxCpltCallback(SD_HandleTypeDef *hsd)
{
  BSP_SD_WriteCpltCallback((hsd == &hsd_sdmmc[0]) ? 0UL : 1UL);
}

/**
  * @brief Rx Transfer completed callbacks
  * @param hsd  SD handle
  * @retval None
  */
__weak void HAL_SD_RxCpltCallback(SD_HandleTypeDef *hsd)
{
  BSP_SD_ReadCpltCallback((hsd == &hsd_sdmmc[0]) ? 0UL : 1UL);
}
#endif /* (USE_HAL_SD_REGISTER_CALLBACKS == 1) */

/**
  * @brief BSP SD Abort callbacks
  * @param  Instance     SD Instance
  * @retval None
  */
__weak void BSP_SD_AbortCallback(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Instance);
}

/**
  * @brief BSP Tx Transfer completed callbacks
  * @param  Instance     SD Instance
  * @retval None
  */
__weak void BSP_SD_WriteCpltCallback(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Instance);
}

/**
  * @brief BSP Rx Transfer completed callbacks
  * @param  Instance     SD Instance
  * @retval None
  */
__weak void BSP_SD_ReadCpltCallback(uint32_t Instance)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(Instance);
}

/**
  * @brief  SD EXTI line detection callbacks.
  * @retval None
  */
static void SD_EXTI_Callback(void)
{
   uint32_t sd_status = SD_PRESENT;
   /* Check SD card detect pin */
  if (HAL_GPIO_ReadPin(SD_GPIO_PORT[0], PinDetect[0]) == GPIO_PIN_SET)
  {
    sd_status = SD_NOT_PRESENT;
  }
  else
  {
    sd_status = SD_PRESENT;
  }
  BSP_SD_DetectCallback(0, sd_status);

}

/**
  * @brief  Initializes the SD MSP.
  * @param  hsd  SD handle
  * @retval None
  */
static void SD_MspInit(SD_HandleTypeDef *hsd)
{
  GPIO_InitTypeDef GPIO_Init_Structure;

  UNUSED(hsd);

  /* Enable SDIO clock */
  __HAL_RCC_SDMMC1_CLK_ENABLE();

  // Reset SDMMC1 Hw IP
   __HAL_RCC_SDMMC1_FORCE_RESET();
   __HAL_RCC_SDMMC1_RELEASE_RESET();

   /* Enable GPIOs clock */
   __HAL_RCC_GPIOA_CLK_ENABLE();
   __HAL_RCC_GPIOB_CLK_ENABLE();
   __HAL_RCC_GPIOC_CLK_ENABLE();
   __HAL_RCC_GPIOD_CLK_ENABLE();

   /* Enable DMAs clock */
   __HAL_RCC_DMA2_CLK_ENABLE();
   __HAL_RCC_DMAMUX1_CLK_ENABLE();

   GPIO_Init_Structure.Mode      = GPIO_MODE_AF_PP;
   GPIO_Init_Structure.Speed     = GPIO_SPEED_FREQ_HIGH;



     /* D0 D1 D2 D3 CK on PC8 PC9 PC10 PC11 PC12 - AF12 NOPULL*/
     GPIO_Init_Structure.Pull      = GPIO_NOPULL;
     GPIO_Init_Structure.Alternate = GPIO_AF12_SDIO1;
     GPIO_Init_Structure.Pin       = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12;
     HAL_GPIO_Init(GPIOC, &GPIO_Init_Structure);



     /* CMD on PD2 - AF12 NOPULL*/
     GPIO_Init_Structure.Pull      = GPIO_NOPULL;
     GPIO_Init_Structure.Alternate = GPIO_AF12_SDIO1;
     GPIO_Init_Structure.Pin       = GPIO_PIN_2;
     HAL_GPIO_Init(GPIOD, &GPIO_Init_Structure);



     /* CKIN on PB15 - AF8 NOPULL*/
     GPIO_Init_Structure.Pull      = GPIO_NOPULL;
     GPIO_Init_Structure.Alternate = GPIO_AF8_SDIO1;
     GPIO_Init_Structure.Pin       = GPIO_PIN_15;
     HAL_GPIO_Init(GPIOB, &GPIO_Init_Structure);



     /* D4 on PB14 - AF11 NOPULL*/
     GPIO_Init_Structure.Pull      = GPIO_NOPULL;
     GPIO_Init_Structure.Alternate = GPIO_AF11_SDIO1;
     GPIO_Init_Structure.Pin       = GPIO_PIN_14;
     HAL_GPIO_Init(GPIOB, &GPIO_Init_Structure);



     /* D5 on PB12 - AF12 NOPULL*/
     GPIO_Init_Structure.Pull      = GPIO_NOPULL;
     GPIO_Init_Structure.Alternate = GPIO_AF12_SDIO1;
     GPIO_Init_Structure.Pin       = GPIO_PIN_12;
     HAL_GPIO_Init(GPIOB, &GPIO_Init_Structure);



     /* D6 on PC6 - AF8 NOPULL*/
     GPIO_Init_Structure.Pull      = GPIO_NOPULL;
     GPIO_Init_Structure.Alternate = GPIO_AF8_SDIO1;
     GPIO_Init_Structure.Pin       = GPIO_PIN_6;
     HAL_GPIO_Init(GPIOC, &GPIO_Init_Structure);



     /* D7 on PC7 - AF12 NOPULL*/
     GPIO_Init_Structure.Pull      = GPIO_NOPULL;
     GPIO_Init_Structure.Alternate = GPIO_AF10_SDIO1;
     GPIO_Init_Structure.Pin       = GPIO_PIN_7;
     HAL_GPIO_Init(GPIOC, &GPIO_Init_Structure);

      #if defined (CORE_CA7)
        IRQ_SetPriority(SDMMC1_IRQn, DEFAULT_IRQ_PRIO);
        IRQ_Enable(SDMMC1_IRQn);
      #endif
}

/**
  * @brief  DeInitializes the SD MSP.
  * @param  hsd  SD handle
  * @retval None
  */
static void SD_MspDeInit(SD_HandleTypeDef *hsd)
{
  GPIO_InitTypeDef gpio_init_structure;

  if(hsd == &hsd_sdmmc[0])
  {

	#if defined(CORE_CM4)
	  HAL_NVIC_DisableIRQ(SDMMC1_IRQn);
	#endif

	#if defined(CORE_CA7)
	  IRQ_Disable(SDMMC1_IRQn);
	#endif

	/* GPIOC configuration */
    gpio_init_structure.Pin = GPIO_PIN_8 | GPIO_PIN_9 | GPIO_PIN_10 | GPIO_PIN_11 | GPIO_PIN_12;
    HAL_GPIO_DeInit(GPIOC, gpio_init_structure.Pin);

    /* GPIOD configuration */
    gpio_init_structure.Pin = GPIO_PIN_2;
    HAL_GPIO_DeInit(GPIOD, gpio_init_structure.Pin);
    /* Disable SDMMC1 clock */
    __HAL_RCC_SDMMC1_CLK_DISABLE();
  }
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
